UNFCOPY.саУНФУправлениеАссортиментом/src/Enums/ВидыОперацийПриходнаяНакладная/ВидыОперацийПриходнаяНакладная.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="98c3dd4c-3115-4847-b155-6a48354b089f">
  <name>ВидыОперацийПриходнаяНакладная</name>
  <objectBelonging>Adopted</objectBelonging>
  <enumValues extendedConfigurationObject="1275fcc5-4473-4b84-b6bf-9e4053c7792c">
    <name>ПриемНаКомиссию</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
</mdclass:Enum>

UNFCOPY.саУНФУправлениеАссортиментом/src/Enums/СпособыЗачетаИРаспределенияПлатежей/СпособыЗачетаИРаспределенияПлатежей.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="ec7f89e5-9da1-40f9-97f2-338018f8f4a1">
  <name>СпособыЗачетаИРаспределенияПлатежей</name>
  <objectBelonging>Adopted</objectBelonging>
  <enumValues extendedConfigurationObject="48e6d05e-8b3d-422a-9cd2-44f911caf9c9">
    <name>Авто</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="5fe38c36-f719-4f3a-9952-dc955b1590f6">
    <name>Вручную</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
</mdclass:Enum>

UNFCOPY.саУНФУправлениеАссортиментом/src/Documents/ПриходнаяНакладная/ПриходнаяНакладная.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="bfd8a708-f45e-44e7-bcd0-d6d6b985ef12">
  <name>ПриходнаяНакладная</name>
  <objectBelonging>Adopted</objectBelonging>
  <attributes extendedConfigurationObject="c6643628-6101-49ab-8b2f-cfc5d50d7c88">
    <name>Договор</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="bc9f28f8-7d29-40cb-bb13-d5167de5ed9a">
    <name>Контрагент</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <tabularSections extendedConfigurationObject="e971571b-9a5a-49eb-b1ac-5fad520ff270">
    <name>Запасы</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="bdea0c48-64db-4877-bf49-28b5e3d7938e">
      <name>Номенклатура</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="b33fc9a5-b4c1-48a4-b014-d2fd3bdd0f7c">
      <name>ЕдиницаИзмерения</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="bb98a81f-fb3e-45d7-bd17-abdbefb5396e">
      <name>Партия</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="220082a1-15f3-4410-a660-609242520fb9">
      <name>ЗаказПокупателя</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="851e4128-c9bc-40e0-b169-6f0503c4c57e">
      <name>Количество</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>15</precision>
            <scale>3</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
  </tabularSections>
</mdclass:Document>

UNFCOPY.саУНФУправлениеАссортиментом/src/CommonForms/АРМ_Склад_ОМА/Module.bsl
#Область НачалоОкончание

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	
	Если Параметры.Свойство("ДатаНачала") Тогда
		ПараметрыДатаНачала = НачалоДня(Параметры.ДатаНачала);
		
		Список.Параметры.УстановитьЗначениеПараметра("ДатаНачала",ПараметрыДатаНачала);
		ОтборПериод.ДатаНачала =	Параметры.ДатаНачала; 
		СписокПриходные.Параметры.УстановитьЗначениеПараметра("ДатаНачала",ПараметрыДатаНачала);
	КонецЕсли; 
	Если Параметры.Свойство("ДатаОкончания") Тогда
		ПараметрыДатаОкончания = КонецДня(Параметры.ДатаОкончания);
		
		Список.Параметры.УстановитьЗначениеПараметра("ДатаОкончания",ПараметрыДатаОкончания);
		СписокПриходные.Параметры.УстановитьЗначениеПараметра("ДатаОкончания",ПараметрыДатаОкончания);

		ОтборПериод.ДатаОкончания =	Параметры.ДатаОкончания;
	КонецЕсли; 
	
	ОМ =ОбщегоНазначения.ОбщийМодуль("саУНФ_РаботаСОМА");
	Если  ОМ=Неопределено Тогда
		ЭтаФорма.Закрыть();
	КонецЕсли; 	  
	
	УстановитьОтборТекущиеДела();
	
	СписокНастроек= ОМ.ПолучитьСтруктураНастроекОМА(); 
	Список.Параметры.УстановитьЗначениеПараметра("ВидЗаказа",СписокНастроек.ВидЗаказаОМА);
	Список.Параметры.УстановитьЗначениеПараметра("Контрагент",СписокНастроек.Поставщик);
	Список.Параметры.УстановитьЗначениеПараметра("СостояниеВРаботе",СписокНастроек.СостояниеВРаботе);
	
	СписокПриходные.Параметры.УстановитьЗначениеПараметра("Контрагент",СписокНастроек.Поставщик);
	СписокПриходные.Параметры.УстановитьЗначениеПараметра("Договор", СписокНастроек.ДоговорПоставщика);
 
	
	
	Отклонен =  СписокНастроек.СостояниеОтклонен;
	ВосстановитьНастройкиОтборов();	
	СписокДетали.Очистить();
	ЗачеркнутьВыбранные();
КонецПроцедуры

&НаСервере
Процедура ПередЗакрытиемНаСервере()
	СохранитьНастройкиОтборов();
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	ПередЗакрытиемНаСервере();
КонецПроцедуры

#КонецОбласти 

#Область МеткиОтборов

&НаСервере
Процедура УстановитьМеткуИОтборСписка(ИмяПоляОтбораСписка, ГруппаРодительМетки, ВыбранноеЗначение, ПредставлениеЗначения="")
	
	Если ПредставлениеЗначения="" Тогда
		ПредставлениеЗначения=Строка(ВыбранноеЗначение);
	КонецЕсли; 
	
	РаботаСОтборами.ПрикрепитьМеткуОтбора(ЭтотОбъект, ИмяПоляОтбораСписка, ГруппаРодительМетки, ВыбранноеЗначение, ПредставлениеЗначения);
	РаботаСОтборами.УстановитьОтборСписка(ЭтотОбъект, Список, ИмяПоляОтбораСписка);
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_МеткаОбработкаНавигационнойСсылки(Элемент, НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	МеткаИД = Сред(Элемент.Имя, СтрДлина("Метка_")+1);
	УдалитьМеткуОтбора(МеткаИД);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	Если ИмяСобытия="ПриОкончанииВыбораПериода" Тогда
		Список.Параметры.УстановитьЗначениеПараметра("ДатаНачала",ОтборПериод.ДатаНачала);
		Список.Параметры.УстановитьЗначениеПараметра("ДатаОкончания",ОтборПериод.ДатаОкончания);
		
		СписокПриходные.Параметры.УстановитьЗначениеПараметра("ДатаНачала",ОтборПериод.ДатаНачала);
		СписокПриходные.Параметры.УстановитьЗначениеПараметра("ДатаОкончания",КонецМесяца(ДобавитьМесяц(ОтборПериод.ДатаНачала,1)));
		
	КонецЕсли; 

КонецПроцедуры



&НаСервере
Процедура УдалитьМеткуОтбора(МеткаИД)
	
	РаботаСОтборами.УдалитьМеткуОтбораСервер(ЭтотОбъект, Список, МеткаИД);
	
КонецПроцедуры

&НаКлиенте
Процедура ПредставлениеПериодаНажатие(Элемент, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	РаботаСОтборамиКлиент.ПредставлениеПериодаВыбратьПериод(ЭтотОбъект, "Список", "Дата",,,"ПриОкончанииВыбораПериода");

КонецПроцедуры



&НаСервере
Процедура СохранитьНастройкиОтборов()
	
	РаботаСОтборами.СохранитьНастройкиОтборов(ЭтотОбъект);
	
КонецПроцедуры

&НаСервере
Процедура ВосстановитьНастройкиОтборов()
	
	РаботаСОтборами.ВосстановитьНастройкиОтборов(ЭтотОбъект,Список);
	
КонецПроцедуры


&НаКлиенте
Процедура СвернутьРазвернутьПанельОтборов(Элемент)
	
	НовоеЗначениеВидимость = НЕ Элементы.ФильтрыНастройкиИДопИнфо.Видимость;
	РаботаСОтборамиКлиент.СвернутьРазвернутьПанельОтборов(ЭтотОбъект, НовоеЗначениеВидимость);
	
КонецПроцедуры

&НаСервере
Процедура УстановитьОтборТекущиеДела()
	
	ПредставлениеПериода = РаботаСОтборамиКлиентСервер.ОбновитьПредставлениеПериода(ОтборПериод);
	РаботаСОтборами.ОбновитьЭлементыМеток(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ОтборСтатусОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	Если Не ЗначениеЗаполнено(ВыбранноеЗначение) Тогда
		Возврат;
	КонецЕсли;
	
	УстановитьМеткуИОтборСписка("Статус", Элемент.Родитель.Имя, ВыбранноеЗначение);
	ВыбранноеЗначение = Неопределено;
	
КонецПроцедуры


#КонецОбласти

#Область Детали

&НаСервере
Процедура СписокПриАктивизацииСтрокиНаСервере(СсылкаЗаказ)
	СписокДетали.Очистить();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ЗаказПокупателяЗапасы.Номенклатура КАК Номенклатура,
	|	ЕСТЬNULL(ЗаказПокупателяЗапасы.Номенклатура.Вес, 0) * ЗаказПокупателяЗапасы.Количество КАК Вес,
	|	ЗаказПокупателяЗапасы.Номенклатура.Длина КАК Длина,
	|	ЗаказПокупателяЗапасы.Номенклатура.Ширина КАК Ширина,
	|	ЗаказПокупателяЗапасы.Номенклатура.Высота КАК Высота,
	|	ЗаказПокупателяЗапасы.Количество КАК Количество
	|ИЗ
	|	Документ.ЗаказПокупателя.Запасы КАК ЗаказПокупателяЗапасы
	|ГДЕ
	|	ЗаказПокупателяЗапасы.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка",СсылкаЗаказ);
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка= РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		НоваяСтрока = СписокДетали.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока,Выборка);
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Функция ДокументЕстьВТаблицеМаршрута(Док)
	СтруктураПоиска = Новый Структура("Заказ",Док);
	МассивНайденных = СписокДетали.НайтиСтроки(СтруктураПоиска);
	Если МассивНайденных.Количество()>0 Тогда
		Возврат Истина;
	Иначе	
		Возврат Ложь;
	КонецЕсли; 
КонецФункции // ()

&НаСервере
Процедура ЗачеркнутьВыбранные()
	ТабВДинСписок=СписокДетали.Выгрузить(,"Заказ");
	МассивНомеров	=	ТабВДинСписок.ВыгрузитьКолонку("Заказ");
	МасивВДинСписок	= 	ОбщегоНазначенияКлиентСервер.СвернутьМассив(МассивНомеров);
	
	Список.КомпоновщикНастроек.Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("МойПараметр", МасивВДинСписок);
	Элементы.Список.Обновить();
КонецПроцедуры


&НаСервере
Процедура СписокНачалоПеретаскиванияНаСервере(МассивПеретаскивания)
	Если ТипЗнч(МассивПеретаскивания) = Тип("Массив") ИЛИ  ТипЗнч(МассивПеретаскивания) = Тип("ТаблицаЗначений") Тогда
		Для каждого  СтрМассива Из МассивПеретаскивания Цикл
			Если ДокументЕстьВТаблицеМаршрута(СтрМассива.Ссылка)	Тогда
				Продолжить;
			КонецЕсли;	
			Для каждого СтрЗаказ Из СтрМассива.Ссылка.Запасы Цикл
				НоваяСтрока = СписокДетали.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрока,СтрЗаказ);
				НоваяСтрока.Заказ = СтрМассива.Ссылка;
				НоваяСтрока.НомерЗаказа = СтрМассива.Ссылка.НомерЗаказаОМА;
			КонецЦикла; 
		КонецЦикла; 
	ИначеЕсли ТипЗнч(МассивПеретаскивания) = Тип("Структура")  Тогда
		//Если ДокументЕстьВТаблицеМаршрута(МассивПеретаскивания.Документ)	Тогда
		//	Возврат;
		//КонецЕсли;
		//
		//НоваяСтрока = ТаблицаМаршрута.Добавить();
		//ЗаполнитьЗначенияСвойств(НоваяСтрока,МассивПеретаскивания);
		//Если ЗначениеЗаполнено(МассивПеретаскивания.ЗонаДоставки) Тогда
		//	ЗонаТариф=МассивПеретаскивания.ЗонаДоставки; 
		//КонецЕсли;                                       
		
	Иначе
		Возврат;
	КонецЕсли; 
	//ТаблицаМаршрутаПриИзмененииНаСервере();
	ЗачеркнутьВыбранные();
КонецПроцедуры    

&НаКлиенте
Процедура СписокНачалоПеретаскивания(Элемент, ПараметрыПеретаскивания, Выполнение)
	СписокНачалоПеретаскиванияНаСервере(ПараметрыПеретаскивания.Значение);
КонецПроцедуры


&НаКлиенте
Процедура Очистить(Команда)
	СписокДетали.Очистить();
	ЗачеркнутьВыбранные();
КонецПроцедуры

&НаСервере
Процедура УдалитьСтроки(НомерЗаказа)
	СтруктураПоиска=Новый Структура("НомерЗаказа",НомерЗаказа);
	МассивСтрок=СписокДетали.НайтиСтроки(СтруктураПоиска);
	Для каждого СтрокаТаблицы Из МассивСтрок Цикл
		СписокДетали.Удалить(СтрокаТаблицы)
	КонецЦикла;
	
	ЗачеркнутьВыбранные();
	
КонецПроцедуры


&НаКлиенте
Процедура СписокДеталиПередУдалением(Элемент, Отказ)
	УдалитьСтроки(Элемент.ТекущиеДанные.НомерЗаказа);
КонецПроцедуры



#КонецОбласти 


#Область ПриходнаяНакладная


&НаСервере
Процедура СоздатьПриходнуюНакладнуюНаСервере(АдресХранилищаПриходной=Неопределено)
	НачатьТранзакцию();
	Попытка
		
		
		Если НЕ  АдресХранилищаПриходной=Неопределено И ЭтоАдресВременногоХранилища(АдресХранилищаПриходной) Тогда
			ПриходСсылка = ПолучитьИзВременногоХранилища(АдресХранилищаПриходной);
			Если Не ТипЗнч(ПриходСсылка) =Тип("ДокументСсылка.ПриходнаяНакладная") Тогда
				ОбщегоНазначения.СообщитьПользователю("Не удалосьполучить приходную накладную");
				ОтменитьТранзакцию();
				Возврат;
			КонецЕсли; 
			ПриходОбъект = ПриходСсылка.ПолучитьОбъект();
			
		Иначе	
			
			СтратегияЗаполнения = Новый Соответствие;
			СтратегияЗаполнения[Тип("Структура")] = "ЗаполнитьПоСтруктуре";
			СтратегияЗаполнения[Тип("ДокументСсылка.РасходнаяНакладная")] = "ЗаполнитьПоРасходнойНакладной";
			СтратегияЗаполнения[Тип("ДокументСсылка.ЗаказПокупателя")] = "ЗаполнитьПоЗаказуПокупателя";
			СтратегияЗаполнения[Тип("ДокументСсылка.ЗаказПоставщику")] = "ЗаполнитьПоЗаказуПоставщику";
			СтратегияЗаполнения[Тип("ДокументСсылка.ПриходныйОрдер")] = "ЗаполнитьПоПриходномуОрдеру";
			СтратегияЗаполнения[Тип("ДокументСсылка.СчетНаОплатуПоставщика")] = "ЗаполнитьПоСчетуНаОплатуПоставщика";
			СтратегияЗаполнения[Тип("ДокументСсылка.СчетНаОплату")] = "ЗаполнитьПоСчетуНаОплатуВозврат";
			СтратегияЗаполнения[Тип("ДокументСсылка.ЧекККМ")] = "ЗаполнитьПоЧекуККМ";
			СтратегияЗаполнения[Тип("ДокументСсылка.ТТНВходящаяЕГАИС")] = "ЗаполнитьПоНакладнойЕГАИС";
			СтратегияЗаполнения[Тип("ДокументСсылка.ПриемИПередачаВРемонт")] = "ЗаполнитьПоПриемуВРемонт";
			СтратегияЗаполнения[Тип("СправочникСсылка.ДоговорыКонтрагентов")] = "ЗаполнитьПоДоговоруКонтрагента";
			СтратегияЗаполнения[Тип("ДокументСсылка.ВходящаяТранспортнаяОперацияВЕТИС")] = "ЗаполнитьПоВходящейТранспортнойОперации";
			СтратегияЗаполнения[Тип("ДокументСсылка.ОтчетКомиссионера")] = "ЗаполнитьПоОтчетуКомиссионера";
			СтратегияЗаполнения[Тип("ДокументСсылка.ПоступлениеНаСчет")] = "ЗаполнитьПоПоступлениюНаСчет";
			
			ДанныеЗаполнения = Новый Структура("ВидОперации,
			|  Дата,
			|   Договор,
			|   Комментарий,
			|   Контрагент,
			|   СпособЗачетаПредоплаты,
			|   СтруктурнаяЕдиница,
			|   СуммаВключаетНДС,
			|   ХозяйственнаяОперация",
			Перечисления.ВидыОперацийПриходнаяНакладная.ПриемНаКомиссию,
			ТекущаяДата(),
			СписокНастроек.ДоговорПоставщика,
			"Введено через АРМ склад ОМА",
			СписокНастроек.Поставщик,
			Перечисления.СпособыЗачетаИРаспределенияПлатежей.Вручную,
			СписокНастроек.Склад,
			Ложь,
			Справочники.ХозяйственныеОперации.ПриемНаКомиссию);
			
			ПриходОбъект = Документы.ПриходнаяНакладная.СоздатьДокумент();
			ЗаполнениеОбъектовУНФ.ЗаполнитьДокумент(ПриходОбъект, ДанныеЗаполнения, СтратегияЗаполнения);
			ПриходОбъект.Запасы.Очистить(); 
		КонецЕсли;
		ТаблицаДетали = РеквизитФормыВЗначение("СписокДетали");
		МассивКолонка =  ТаблицаДетали.ВыгрузитьКолонку("Заказ");
		МассивСсылок=ОбщегоНазначенияКлиентСервер.СвернутьМассив(МассивКолонка);
		
		Для каждого СтрТаб Из  МассивСсылок Цикл
			ЗапасЗаказа =  СтрТаб.Запасы;
			Для каждого СтрокаЗапасы Из  ЗапасЗаказа Цикл
				НоваяСтрока   =  ПриходОбъект.Запасы.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрока,СтрокаЗапасы);
				НоваяСтрока.ЗаказПокупателя = СтрТаб;
			КонецЦикла; 
		КонецЦикла; 	
		
		ПриходОбъект.Записать(РежимЗаписиДокумента.Проведение);
		
		Для каждого СтрТаб Из  МассивСсылок Цикл
			ЗаказаОбъект =СтрТаб.ПолучитьОбъект();
			ЗаказаОбъект.СостояниеЗаказа = СписокНастроек.СостояниеНаРЦ;
			ЗаказаОбъект.Записать();
		КонецЦикла; 
		ЗафиксироватьТранзакцию();
		СписокДетали.Очистить();
		Элементы.Список.Обновить();

	Исключение
		Элементы.Список.Обновить();
		ОтменитьТранзакцию();
		ОбщегоНазначения.СообщитьПользователю("Не удалось записать документ "+ОписаниеОшибки());
		Возврат;
	КонецПопытки;
	
		
КонецПроцедуры



&НаКлиенте
АСИНХ Функция ЗадатьВопросОДобавленииВПриходную(АдресХранилищаПриходной)
	СписокКнопок = Новый СписокЗначений;
	СписокКнопок.Добавить("Добавить", НСтр("ru = ' Добавить в существующую'", "ru"));
	СписокКнопок.Добавить("Новый", НСтр("ru = ' Создать новую'", "ru"));
	СписокКнопок.Добавить(КодВозвратаДиалога.Отмена);
	
	ТекстВопроса = "Сегодня уже создана приходная накладная. Хотите добавить товар в неё?";
	
	
	Результат = Ждать ВопросАсинх(ТекстВопроса, СписокКнопок);
	Если Результат = "Добавить" Тогда
		СоздатьПриходнуюНакладнуюНаСервере(АдресХранилищаПриходной);
	ИначеЕсли Результат = "Новый" Тогда
		СоздатьПриходнуюНакладнуюНаСервере();
	КонецЕсли;
	
	
	
КонецФункции // ()

&НаСервере
Функция ПроверитьЕстьПриходная()
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ПриходнаяНакладная.Ссылка КАК Ссылка,
	|	ПриходнаяНакладная.Номер КАК Номер,
	|	ПриходнаяНакладная.Дата КАК Дата
	|ИЗ
	|	Документ.ПриходнаяНакладная КАК ПриходнаяНакладная
	|ГДЕ
	|	ПриходнаяНакладная.Контрагент = &Контрагент
	|	И ПриходнаяНакладная.Договор = &Договор
	|	И НЕ ПриходнаяНакладная.ПометкаУдаления
	|	И ПриходнаяНакладная.Дата МЕЖДУ &ДатаНачала И &ДатаОкончания";
	
	Запрос.УстановитьПараметр("ДатаНачала", НачалоДня(ТекущаяДата()));
	Запрос.УстановитьПараметр("ДатаОкончания", КонецДня(ТекущаяДата()));
	Запрос.УстановитьПараметр("Договор", СписокНастроек.ДоговорПоставщика);
	Запрос.УстановитьПараметр("Контрагент", СписокНастроек.Поставщик);
	
	Результат = Запрос.Выполнить();
	Если Результат.Пустой() Тогда
		Возврат Неопределено;
	КонецЕсли; 
	
	Выборка = Результат.Выбрать();
	Выборка.Следующий();
	АдресХранилищаМаршрута=ПоместитьВоВременноеХранилище(Выборка.Ссылка) ;
	
	
	Возврат АдресХранилищаМаршрута;
	
	
	
КонецФункции


&НаКлиенте
Процедура ВзятьВРаботу(Команда)
	Если  СписокДетали.Количество()=0	 Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю("Добавлять нечего");
		Возврат;
	КонецЕсли; 	
	
	АдресХранилищаПриходной = ПроверитьЕстьПриходная();
	Если НЕ  АдресХранилищаПриходной=Неопределено И ЭтоАдресВременногоХранилища(АдресХранилищаПриходной) Тогда
		ЗадатьВопросОДобавленииВПриходную(АдресХранилищаПриходной);
	Иначе
		СоздатьПриходнуюНакладнуюНаСервере();
	КонецЕсли; 
		
КонецПроцедуры

&НаСервере
Процедура СписокПриходныеПриАктивизацииНаСервере(Ссылка)
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПриходнаяНакладнаяЗапасы.Ссылка КАК Ссылка,
		|	ПриходнаяНакладнаяЗапасы.Номенклатура КАК Номенклатура,
		|	ПриходнаяНакладнаяЗапасы.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
		|	ПриходнаяНакладнаяЗапасы.Партия КАК Партия,
		|	ПриходнаяНакладнаяЗапасы.ЗаказПокупателя.НомерЗаказаОМА КАК НомерЗаказа,
		|	ПриходнаяНакладнаяЗапасы.Количество КАК Количество
		|ИЗ
		|	Документ.ПриходнаяНакладная.Запасы КАК ПриходнаяНакладнаяЗапасы
		|ГДЕ
		|	ПриходнаяНакладнаяЗапасы.Ссылка = &Ссылка";
	Запрос.УстановитьПараметр("Ссылка",Ссылка);
	ТаблицаРезультата = Запрос.Выполнить().Выгрузить();
	ТаблицаПриход.Очистить();
	ТаблицаПриход.Загрузить(ТаблицаРезультата);


КонецПроцедуры


&НаКлиенте
Процедура СписокПриходныеПриАктивизацииСтроки(Элемент)
	Если НЕ Элемент.ТекущиеДанные = неопределено Тогда
		СписокПриходныеПриАктивизацииНаСервере(Элемент.ТекущиеДанные.Ссылка);
	КонецЕсли; 
КонецПроцедуры



#КонецОбласти
